Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFM064.atdf
         <register caption="Device Configuration Word 2" name="DEVCFG2" initval="0xFFF9B198">
            <bitfield caption="PLL Input Divider bits" mask="0x7" name="FPLLIDIV" values="DEVCFG2__FPLLIDIV"/>
            <bitfield caption="System PLL Divided Input Clock Frequency Range bits" mask="0x70" name="FPLLRNG" values="DEVCFG2__FPLLRNG"/>
            <bitfield caption="System PLL Input Clock Select bit" mask="0x80" name="FPLLICLK" values="DEVCFG2__FPLLICLK"/>
            <bitfield caption="System PLL Feedback Divider bits" mask="0x7f00" name="FPLLMULT" values="DEVCFG2__FPLLMULT"/>
            <bitfield caption="Default System PLL Output Divisor bits" mask="0x70000" name="FPLLODIV" values="DEVCFG2__FPLLODIV"/>
            <bitfield caption="USB PLL Input Frequency Select bit" mask="0x40000000" name="UPLLFSEL" values="DEVCFG2__UPLLFSEL"/>
         </register>
         <register caption="Device Configuration Word 1" name="DEVCFG1" initval="0x5F74FF39">
            <bitfield caption="Oscillator Selection bits" mask="0x7" name="FNOSC" values="DEVCFG1__FNOSC"/>
            <bitfield caption="Deadman Timer Count Window Interval bits" mask="0x38" name="DMTINTV" values="DEVCFG1__DMTINTV"/>
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x40" name="FSOSCEN" values="DEVCFG1__FSOSCEN"/>
            <bitfield caption="Internal External Switchover bit" mask="0x80" name="IESO" values="DEVCFG1__IESO"/>
            <bitfield caption="Primary Oscillator Configuration bits" mask="0x300" name="POSCMOD" values="DEVCFG1__POSCMOD"/>
            <bitfield caption="CLKO Enable Configuration bit" mask="0x400" name="OSCIOFNC" values="DEVCFG1__OSCIOFNC"/>
            <bitfield caption="Clock Switching and Monitoring Selection Configuration bits" mask="0xc000" name="FCKSM" values="DEVCFG1__FCKSM"/>
            <bitfield caption="Watchdog Timer Postscale Select bits" mask="0x1f0000" name="WDTPS" values="DEVCFG1__WDTPS"/>
            <bitfield caption="Watchdog Timer Stop During Flash Programming bit" mask="0x200000" name="WDTSPGM" values="DEVCFG1__WDTSPGM"/>
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x400000" name="WINDIS" values="DEVCFG1__WINDIS"/>
            <bitfield caption="Watchdog Timer Enable bit" mask="0x800000" name="FWDTEN" values="DEVCFG1__FWDTEN"/>
            <bitfield caption="Watchdog Timer Window Size bits" mask="0x3000000" name="FWDTWINSZ" values="DEVCFG1__FWDTWINSZ"/>
            <bitfield caption="Deadman Timer Count Select bits" mask="0x7c000000" name="DMTCNT" values="DEVCFG1__DMTCNT"/>
            <bitfield caption="Deadman Timer enable bit" mask="0x80000000L" name="FDMTEN" values="DEVCFG1__FDMTEN"/>
         </register>
         <register caption="Device Configuration Word 0" name="DEVCFG0" initval="0xFFFFF7DB">
            <bitfield caption="Background Debugger Enable bits" mask="0x3" name="DEBUG" values="DEVCFG0__DEBUG"/>
            <bitfield caption="JTAG Enable bit" mask="0x4" name="JTAGEN" values="DEVCFG0__JTAGEN"/>
            <bitfield caption="In-Circuit Emulator/Debugger Communication Channel Select bits" mask="0x18" name="ICESEL" values="DEVCFG0__ICESEL"/>
            <bitfield caption="Trace Enable bit" mask="0x20" name="TRCEN" values="DEVCFG0__TRCEN"/>
            <bitfield caption="Boot ISA Selection bit" mask="0x40" name="BOOTISA" values="DEVCFG0__BOOTISA"/>
            <bitfield caption="Dynamic Flash ECC Configuration bits" mask="0x300" name="FECCCON" values="DEVCFG0__FECCCON"/>
            <bitfield caption="Flash Sleep Mode bit" mask="0x400" name="FSLEEP" values="DEVCFG0__FSLEEP"/>
            <bitfield caption="Debug Mode CPU Access Permission" mask="0x7000" name="DBGPER" values="DEVCFG0__DBGPER"/>
            <bitfield caption="Soft Master Clear Enable bit" mask="0x8000" name="SMCLR" values="DEVCFG0__SMCLR"/>
            <bitfield caption="Secondary Oscillator Gain Control bits" mask="0x30000" name="SOSCGAIN" values="DEVCFG0__SOSCGAIN"/>
            <bitfield caption="Secondary Oscillator Boost Kick Start Enable bit" mask="0x40000" name="SOSCBOOST" values="DEVCFG0__SOSCBOOST"/>
            <bitfield caption="Primary Oscillator Gain Control bits" mask="0x180000" name="POSCGAIN" values="DEVCFG0__POSCGAIN"/>
            <bitfield caption="Primary Oscillator Boost Kick Start Enable bit" mask="0x200000" name="POSCBOOST" values="DEVCFG0__POSCBOOST"/>
            <bitfield caption="EJTAG Boot Enable bit" mask="0x40000000" name="EJTAGBEN" values="DEVCFG0__EJTAGBEN"/>
         </register>
         <register caption="Device Code-Protect 0 Register" name="DEVCP0" initval="0xFFFFFFFF">
            <bitfield caption="Code-Protect bit" mask="0x10000000" name="CP" values="DEVCP0__CP"/>
         </register>
         <register caption="Sequence Word 3 Register" name="SEQ3" initval="0x0000FFFF">
            <bitfield caption="Boot Flash True Sequence Number bits" mask="0xffff" name="TSEQ" values="SEQ3__TSEQ"/>
            <bitfield caption="Boot Flash Complement Sequence Number bits" mask="0xffff0000L" name="CSEQ" values="SEQ3__CSEQ"/>
         </register>
      </register-group>
      <value-group caption="UserID" name="DEVCFG3__USERID">
         <value caption="User ID" name=""/>
      </value-group>
      <value-group caption="Ethernet MII Enable Configuration bit" name="DEVCFG3__FMIIEN">
         <value caption="RMII Enabled" name="OFF" value="0x0"/>
         <value caption="MII Enabled" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Ethernet I/O Pin Selection Configuration bit" name="DEVCFG3__FETHIO">
         <value caption="Alternate Ethernet I/O" name="OFF" value="0x0"/>
         <value caption="Default Ethernet I/O" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="Permission Group Lock One Way Configuration bit" name="DEVCFG3__PGL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1"/>
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Module Disable Configuration bit" name="DEVCFG3__PMDL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1"/>
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Pin Select Configuration bit" name="DEVCFG3__IOL1WAY">
         <value caption="Allow only one reconfiguration" name="ON" value="0x1"/>
         <value caption="Allow multiple reconfigurations" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="USB USBID Selection bit" name="DEVCFG3__FUSBIDIO">
         <value caption="Controlled by Port Function" name="OFF" value="0x0"/>
         <value caption="Controlled by the USB Module" name="ON" value="0x1"/>
      </value-group>
      <value-group caption="PLL Input Divider bits" name="DEVCFG2__FPLLIDIV">
         <value caption="1x Divider" name="DIV_1" value="0x0"/>
         <value caption="2x Divider" name="DIV_2" value="0x1"/>
         <value caption="3x Divider" name="DIV_3" value="0x2"/>
         <value caption="4x Divider" name="DIV_4" value="0x3"/>
         <value caption="5x Divider" name="DIV_5" value="0x4"/>
         <value caption="6x Divider" name="DIV_6" value="0x5"/>
         <value caption="7x Divider" name="DIV_7" value="0x6"/>
         <value caption="8x Divider" name="DIV_8" value="0x7"/>
      </value-group>
      <value-group caption="System PLL Divided Input Clock Frequency Range bits" name="DEVCFG2__FPLLRNG">
         <value caption="Bypass" name="RANGE_BYPASS" value="0x0"/>
         <value caption="5-10 MHz Input" name="RANGE_5_10_MHZ" value="0x1"/>
         <value caption="8-16 MHz Input" name="RANGE_8_16_MHZ" value="0x2"/>
         <value caption="13-26 MHz Input" name="RANGE_13_26_MHZ" value="0x3"/>
         <value caption="21-42 MHz Input" name="RANGE_21_42_MHZ" value="0x4"/>
         <value caption="34-68 MHz Input" name="RANGE_34_68_MHZ" value="0x5"/>
      </value-group>
