Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFM064.atdf
      <value-group caption="Transmit Buffer Interrupt Enable bit" name="C1INT__TBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Interrupt Enable bit" name="C1INT__RBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Timestamp Timer Interrupt Enable bit" name="C1INT__CTMRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="C1INT__MODIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="C1INT__RBOVIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="C1INT__SERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="C1INT__CERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Enable bit" name="C1INT__WAKIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Enable bit" name="C1INT__IVRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1L"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Flag bit" name="C2INT__TBIF">
         <value caption="A transmit buffer interrupt is pending" name="" value="0x1"/>
         <value caption="A transmit buffer interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Interrupt Flag bit" name="C2INT__RBIF">
         <value caption="A receive buffer interrupt is pending" name="" value="0x1"/>
         <value caption="A receive buffer interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Timer Overflow Interrupt Flag bit" name="C2INT__CTMRIF">
         <value caption="A CAN timer (CANTMR) overflow has occurred" name="" value="0x1"/>
         <value caption="A CAN timer (CANTMR) overflow has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Mode Change Interrupt Flag bit" name="C2INT__MODIF">
         <value caption="A CAN module mode change has occurred (OPMOD has changed to reflect REQOP)" name="" value="0x1"/>
         <value caption="A CAN module mode change has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Flag bit" name="C2INT__RBOVIF">
         <value caption="A receive buffer overflow has occurred" name="" value="0x1"/>
         <value caption="A receive buffer overflow has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Error Interrupt Flag bit" name="C2INT__SERRIF">
         <value caption="A system error occurred (typically an illegal address was presented to the System Bus)" name="" value="0x1"/>
         <value caption="A system error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Flag bit" name="C2INT__CERRIF">
         <value caption="A CAN bus error has occurred" name="" value="0x1"/>
         <value caption="A CAN bus error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Flag bit" name="C2INT__WAKIF">
         <value caption="A bus wake-up activity interrupt has occurred" name="" value="0x1"/>
         <value caption="A bus wake-up activity interrupt has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Flag bit" name="C2INT__IVRIF">
         <value caption="An invalid messages interrupt has occurred" name="" value="0x1"/>
         <value caption="An invalid message interrupt has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Enable bit" name="C2INT__TBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Interrupt Enable bit" name="C2INT__RBIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Timestamp Timer Interrupt Enable bit" name="C2INT__CTMRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Mode Change Interrupt Enable bit" name="C2INT__MODIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
