Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFM064.atdf
      <value-group caption="Filter 7 Enable bit" name="C2FLTCON1__FLTEN7">
         <value caption="Filter is enabled" name="" value="0x1L"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL8">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 8 Mask Select bits" name="C1FLTCON2__MSEL8">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 8 Enable bit" name="C1FLTCON2__FLTEN8">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL9">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 9 Mask Select bits" name="C1FLTCON2__MSEL9">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 9 Enable bit" name="C1FLTCON2__FLTEN9">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL10">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 10 Mask Select bits" name="C1FLTCON2__MSEL10">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 10 Enable bit" name="C1FLTCON2__FLTEN10">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON2__FSEL11">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 11 Mask Select bits" name="C1FLTCON2__MSEL11">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 11 Enable bit" name="C1FLTCON2__FLTEN11">
         <value caption="Filter is enabled" name="" value="0x1L"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON2__FSEL8">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 8 Mask Select bits" name="C2FLTCON2__MSEL8">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 8 Enable bit" name="C2FLTCON2__FLTEN8">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C2FLTCON2__FSEL9">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 9 Mask Select bits" name="C2FLTCON2__MSEL9">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 9 Enable bit" name="C2FLTCON2__FLTEN9">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
