Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFM064.atdf
         <register caption="Interrupt Priority Control Registe" name="IPC42" offset="0x3e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="PREIS"/>
            <bitfield mask="0x0000001C" name="PREIP"/>
            <bitfield mask="0x00000300" name="SQI1IS"/>
            <bitfield mask="0x00001C00" name="SQI1IP"/>
            <bitfield mask="0x00030000" name="U4EIS"/>
            <bitfield mask="0x001C0000" name="U4EIP"/>
            <bitfield mask="0x03000000" name="U4RXIS"/>
            <bitfield mask="0x1C000000" name="U4RXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC43" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U4TXIS"/>
            <bitfield mask="0x0000001C" name="U4TXIP"/>
            <bitfield mask="0x00000300" name="I2C4BIS"/>
            <bitfield mask="0x00001C00" name="I2C4BIP"/>
            <bitfield mask="0x00030000" name="I2C4SIS"/>
            <bitfield mask="0x001C0000" name="I2C4SIP"/>
            <bitfield mask="0x03000000" name="I2C4MIS"/>
            <bitfield mask="0x1C000000" name="I2C4MIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC44" offset="0x400" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI5EIS"/>
            <bitfield mask="0x0000001C" name="SPI5EIP"/>
            <bitfield mask="0x00000300" name="SPI5RXIS"/>
            <bitfield mask="0x00001C00" name="SPI5RXIP"/>
            <bitfield mask="0x00030000" name="SPI5TXIS"/>
            <bitfield mask="0x001C0000" name="SPI5TXIP"/>
            <bitfield mask="0x03000000" name="U5EIS"/>
            <bitfield mask="0x1C000000" name="U5EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC45" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U5RXIS"/>
            <bitfield mask="0x0000001C" name="U5RXIP"/>
            <bitfield mask="0x00000300" name="U5TXIS"/>
            <bitfield mask="0x00001C00" name="U5TXIP"/>
            <bitfield mask="0x00030000" name="I2C5BIS"/>
            <bitfield mask="0x001C0000" name="I2C5BIP"/>
            <bitfield mask="0x03000000" name="I2C5SIS"/>
            <bitfield mask="0x1C000000" name="I2C5SIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC46" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C5MIS"/>
            <bitfield mask="0x0000001C" name="I2C5MIP"/>
            <bitfield mask="0x00000300" name="SPI6EIS"/>
            <bitfield mask="0x00001C00" name="SPI6EIP"/>
            <bitfield mask="0x00030000" name="SPI6RXIS"/>
            <bitfield mask="0x001C0000" name="SPI6RXIP"/>
            <bitfield mask="0x03000000" name="SPI6TXIS"/>
            <bitfield mask="0x1C000000" name="SPI6TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC47" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U6EIS"/>
            <bitfield mask="0x0000001C" name="U6EIP"/>
            <bitfield mask="0x00000300" name="U6RXIS"/>
            <bitfield mask="0x00001C00" name="U6RXIP"/>
            <bitfield mask="0x00030000" name="U6TXIS"/>
            <bitfield mask="0x001C0000" name="U6TXIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC48" offset="0x440" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCEOSIS"/>
            <bitfield mask="0x0000001C" name="ADCEOSIP"/>
            <bitfield mask="0x00000300" name="ADCARDYIS"/>
            <bitfield mask="0x00001C00" name="ADCARDYIP"/>
            <bitfield mask="0x00030000" name="ADCURDYIS"/>
            <bitfield mask="0x001C0000" name="ADCURDYIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC49" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCGRPIS"/>
            <bitfield mask="0x0000001C" name="ADCGRPIP"/>
            <bitfield mask="0x00030000" name="ADC0EIS"/>
            <bitfield mask="0x001C0000" name="ADC0EIP"/>
            <bitfield mask="0x03000000" name="ADC1EIS"/>
            <bitfield mask="0x1C000000" name="ADC1EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC50" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADC2EIS"/>
            <bitfield mask="0x0000001C" name="ADC2EIP"/>
            <bitfield mask="0x00000300" name="ADC3EIS"/>
            <bitfield mask="0x00001C00" name="ADC3EIP"/>
            <bitfield mask="0x00030000" name="ADC4EIS"/>
            <bitfield mask="0x001C0000" name="ADC4EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC51" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x00000300" name="ADC7EIS"/>
            <bitfield mask="0x00001C00" name="ADC7EIP"/>
            <bitfield mask="0x00030000" name="ADC0WIS"/>
            <bitfield mask="0x001C0000" name="ADC0WIP"/>
            <bitfield mask="0x03000000" name="ADC1WIS"/>
            <bitfield mask="0x1C000000" name="ADC1WIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC52" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADC2WIS"/>
            <bitfield mask="0x0000001C" name="ADC2WIP"/>
            <bitfield mask="0x00000300" name="ADC3WIS"/>
            <bitfield mask="0x00001C00" name="ADC3WIP"/>
            <bitfield mask="0x00030000" name="ADC4WIS"/>
            <bitfield mask="0x001C0000" name="ADC4WIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC53" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000300" name="ADC7WIS"/>
            <bitfield mask="0x00001C00" name="ADC7WIP"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF000" offset="0x540" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
         <register caption="Interrupt Vector Address Offset Registe" name="OFF001" offset="0x544" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF"/>
         </register>
