Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFM064.atdf
      <value-group caption="Timer On bit" name="T8CON__ON">
         <value caption="Module is enabled" name="" value="0x1"/>
         <value caption="Module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T9CON__TCS">
         <value caption="External clock from TxCK pin" name="" value="0x1"/>
         <value caption="Internal peripheral clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T9CON__T32">
         <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1"/>
         <value caption="Odd numbered and even numbered timers form separate 16-bit timers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T9CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x7"/>
         <value caption="1:64 prescale value" name="" value="0x6"/>
         <value caption="1:32 prescale value" name="" value="0x5"/>
         <value caption="1:16 prescale value" name="" value="0x4"/>
         <value caption="1:8 prescale value" name="" value="0x3"/>
         <value caption="1:4 prescale value" name="" value="0x2"/>
         <value caption="1:2 prescale value" name="" value="0x1"/>
         <value caption="1:1 prescale value" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T9CON__TGATE">
         <value caption="(When TCS is 1): Gated time accumulation is enabled / (When TCS=0): bit is ignored and read as 0" name="" value="0x1"/>
         <value caption="(When TCS is 0): Gated time accumulation is disabled / (When TCS=0): bit is ignored and read as 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T9CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation even in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer On bit" name="T9CON__ON">
         <value caption="Module is enabled" name="" value="0x1"/>
         <value caption="Module is disabled" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00734" name="UART" version="1">
      <register-group name="UART">
         <register caption="UARTx Mode Register" name="U1MODE" offset="0x0" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U1MODE__STSEL"/>
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U1MODE__PDSEL"/>
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U1MODE__BRGH"/>
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U1MODE__RXINV"/>
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U1MODE__ABAUD"/>
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U1MODE__LPBACK"/>
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U1MODE__WAKE"/>
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U1MODE__UEN"/>
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U1MODE__RTSMD"/>
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U1MODE__IREN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U1MODE__SIDL"/>
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U1MODE__ON"/>
         </register>
         <register caption="UARTx Mode Register" name="U2MODE" offset="0x200" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U2MODE__STSEL"/>
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U2MODE__PDSEL"/>
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U2MODE__BRGH"/>
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U2MODE__RXINV"/>
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U2MODE__ABAUD"/>
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U2MODE__LPBACK"/>
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U2MODE__WAKE"/>
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U2MODE__UEN"/>
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U2MODE__RTSMD"/>
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U2MODE__IREN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U2MODE__SIDL"/>
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U2MODE__ON"/>
         </register>
         <register caption="UARTx Mode Register" name="U3MODE" offset="0x400" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U3MODE__STSEL"/>
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U3MODE__PDSEL"/>
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U3MODE__BRGH"/>
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U3MODE__RXINV"/>
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U3MODE__ABAUD"/>
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U3MODE__LPBACK"/>
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U3MODE__WAKE"/>
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U3MODE__UEN"/>
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U3MODE__RTSMD"/>
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U3MODE__IREN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U3MODE__SIDL"/>
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U3MODE__ON"/>
         </register>
         <register caption="UARTx Mode Register" name="U4MODE" offset="0x600" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U4MODE__STSEL"/>
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U4MODE__PDSEL"/>
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U4MODE__BRGH"/>
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U4MODE__RXINV"/>
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U4MODE__ABAUD"/>
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U4MODE__LPBACK"/>
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U4MODE__WAKE"/>
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U4MODE__UEN"/>
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U4MODE__RTSMD"/>
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U4MODE__IREN"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U4MODE__SIDL"/>
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U4MODE__ON"/>
         </register>
